"""
Написать функцию host_range_ping_tab(), возможности которой основаны на функции из
примера 2. Но в данном случае результат должен быть итоговым по всем ip-адресам,
представленным в табличном формате (использовать модуль tabulate). Таблица должна
состоять из двух колонок и выглядеть примерно так:
Reachable
-------------
10.0.0.1
10.0.0.2
Unreachable
-------------
10.0.0.3
10.0.0.4
"""
from tabulate import tabulate
from task_2 import host_range_ping


def host_range_ping_tab():
    res_dict = host_range_ping()
    print('============================')
    print(tabulate([res_dict], headers='keys', tablefmt="pipe", stralign="center"))


if __name__ == '__main__':
    host_range_ping_tab()

"""
Резульат:
192.168.1.1 - Узел доступен
192.168.1.2 - Узел недоступен
192.168.1.3 - Узел недоступен
192.168.1.4 - Узел недоступен
192.168.1.5 - Узел недоступен
192.168.1.6 - Узел недоступен
192.168.1.7 - Узел недоступен
192.168.1.8 - Узел недоступен
192.168.1.9 - Узел недоступен
192.168.1.10 - Узел недоступен
192.168.1.11 - Узел недоступен
192.168.1.12 - Узел недоступен
192.168.1.13 - Узел недоступен
192.168.1.14 - Узел недоступен
192.168.1.15 - Узел недоступен
192.168.1.16 - Узел недоступен
192.168.1.17 - Узел недоступен
192.168.1.18 - Узел недоступен
192.168.1.19 - Узел недоступен
192.168.1.20 - Узел недоступен
============================
|  Узел доступен  |  Узел недоступен  |
|:---------------:|:-----------------:|
|   192.168.1.1   |    192.168.1.2    |
|                 |    192.168.1.3    |
|                 |    192.168.1.4    |
|                 |    192.168.1.5    |
|                 |    192.168.1.6    |
|                 |    192.168.1.7    |
|                 |    192.168.1.8    |
|                 |    192.168.1.9    |
|                 |   192.168.1.10    |
|                 |   192.168.1.11    |
|                 |   192.168.1.12    |
|                 |   192.168.1.13    |
|                 |   192.168.1.14    |
|                 |   192.168.1.15    |
|                 |   192.168.1.16    |
|                 |   192.168.1.17    |
|                 |   192.168.1.18    |
|                 |   192.168.1.19    |
|                 |   192.168.1.20    |

Process finished with exit code 0

"""
